FURNISHING_SYNONYMS = {
    "معشية": True, "معشيه": True, "مأثثة": True, 
    "مفروشة": True, "مفروش": True, "فرش": True,
    "فاضية": False, "فاضيه": False, "غير مفروشة": False,
    "بدون فرش": False, "فاضي": False, "عظم": False
}

TRANSACTION_SYNONYMS = {
    "ايجار": "rent", "إيجار": "rent", "الايجار": "rent", "للايجار": "rent", "للإيجار": "rent",
    "اجار": "rent", "استئجار": "rent", "أجار": "rent", "يومية": "rent",
    "بيع": "sale", "شراء": "sale", "شري": "sale", "اشتري": "sale", "للبيع": "sale",
}

CATEGORY_SYNONYMS = {
    "شقة للبيع": 10301, "شقق للبيع": 10301,
    "فيلا للبيع": 10101, "فلل للبيع": 10101,
    "بيت للبيع": 10102, "بيت مستقل للبيع": 10102,
    "ستوديو للبيع": 10302, 
    "ارض": 19000, "أراضي": 19000, "اراضي": 19000,
    "شقة للايجار": 301, "شقق للايجار": 301, "شقه ايجار": 301,
    "فيلا للايجار": 3101, "فلل للايجار": 3101,
    "ستوديو للايجار": 302, "ستوديو ايجار": 302,
    "شقة": 10301, "شقه": 10301,
    "فيلا": 10101, "فله": 10101,
    "بيت": 10102, "دار": 10102,
    "ستوديو": 10302, "استوديو": 10302,
    "محل": 10853, "دكان": 10853,
    "مكتب": 18004,
    "روف": 10105, "ملحق": 10105,
    "مزرعة": 19201, "مزارع": 19201,
    "شاليه": 19301
}

ZONE_REGIONS = {
    "عمان الشرقية": ["ماركا", "طبربور", "القويسمة", "الهاشمي الجنوبي", "الهاشمي الشمالي", "ابو علندا", "المقابلين", "اليادودة", "جبل التاج", "جبل النصر", "الاشرفية"],
    "شرق عمان": ["ماركا", "طبربور", "القويسمة", "الهاشمي الجنوبي", "الهاشمي الشمالي", "ابو علندا", "المقابلين", "اليادودة", "جبل التاج", "جبل النصر", "الاشرفية"],
    "عمان الغربية": ["عبدون", "الصويفية", "دير غبار", "خلدا", "دابوق", "الرابية", "ام اذينة", "الشميساني", "تلاع العلي", "الجاردنز", "ضاحية الرشيد"],
    "غرب عمان": ["عبدون", "الصويفية", "دير غبار", "خلدا", "دابوق", "الرابية", "ام اذينة", "الشميساني", "تلاع العلي", "الجاردنز", "ضاحية الرشيد"],
    "شمال عمان": ["شفا بدران", "ابو نصير", "صافوط", "الجبيهة", "طارق", "ياجوز"],
    "جنوب عمان": ["سحاب", "الجيزة", "الموقر", "طريق المطار", "خريبة السوق", "جاوا"],
}
